wosayttn/M55M1BSP/_CUnit/spim/spim.c
/******************************************************************************
 * @file    spim.c
 * @version V1.00
 * $Revision:1$
 * $Date:14/5/5 5:45p$
 * @brief   M480 series SPIM driver
 *
 * @note
 * Copyright (C) 2016 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <string.h>
#include "M480.h"


/** @addtogroup M480_Device_Driver M480 Device Driver
  @{
*/

/** @addtogroup M480_SPIM_Driver SPIM Driver
  @{
*/

/** @addtogroup M480_SPIM_EXPORTED_FUNCTIONS SPIM Exported Functions
  @{
*/

#define SPIM_DRV_DEBUG     printf
//#define SPIM_DRV_DEBUG(...)


static volatile uint8_t  g_MID = MFGID_UNKNOW;  // Manufacture ID


static void SwitchNBitOutput(uint32_t u32NBit)
{
    switch (u32NBit)
    {
        case 1:
            _SPIM_ENABLE_SING_OUTPUT_MODE();        // 1-bit, Output.
            break;

        case 2:
            _SPIM_ENABLE_DUAL_OUTPUT_MODE();        // 2-bit, Output.
            break;

        case 4:
            _SPIM_ENABLE_QUAD_OUTPUT_MODE();        // 4-bit, Output.
            break;
    }
}

static void SwitchNBitInput(uint32_t u32NBit)
{
    switch (u32NBit)
    {
        case 1:
            _SPIM_ENABLE_SING_INPUT_MODE();         // 1-bit, Input.
            break;

        case 2:
            _SPIM_ENABLE_DUAL_INPUT_MODE();         // 2-bit, Input.
            break;

        case 4:
            _SPIM_ENABLE_QUAD_INPUT_MODE();         // 4-bit, Input.
            break;
    }
}

/**
  * @brief      Write data to SPI slave.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      u32NTx      Number of bytes to transmit.
  * @return     None.
  */
static void spim_write(const uint8_t *pu8TxBuf, uint32_t u32NTx)
{
    while (u32NTx)
    {
        unsigned int dataNum = 0, dataNum2;

        if (u32NTx >= 16)
        {
            dataNum = 4;
        }
        else if (u32NTx >= 12)
        {
            dataNum = 3;
        }
        else if (u32NTx >= 8)
        {
            dataNum = 2;
        }
        else if (u32NTx >= 4)
        {
            dataNum = 1;
        }

        dataNum2 = dataNum;

        while (dataNum2)
        {
            uint32_t tmp;

            memcpy(&tmp, pu8TxBuf, 4);
            pu8TxBuf += 4;
            u32NTx -= 4;

            dataNum2 --;
            *((__O uint32_t *) &SPIM->TX0 + dataNum2) = tmp;
        }

        if (dataNum)
        {
            _SPIM_SET_OPMODE(SPIM_CTL0_OPMODE_IO);    // Switch to Normal mode.
            _SPIM_SET_DATA_WIDTH(32);
            _SPIM_SET_DATA_NUM(dataNum);
            _SPIM_SET_GO();
            _SPIM_WAIT_FREE();
        }

        if (u32NTx && u32NTx < 4)
        {
            int rmn = u32NTx;

            uint32_t tmp;
            memcpy(&tmp, pu8TxBuf, u32NTx);
            pu8TxBuf += u32NTx;
            u32NTx = 0;
            SPIM->TX0 = tmp;

            _SPIM_SET_OPMODE(SPIM_CTL0_OPMODE_IO);    // Switch to Normal mode.
            _SPIM_SET_DATA_WIDTH(rmn * 8);
            _SPIM_SET_DATA_NUM(1);
            _SPIM_SET_GO();
            _SPIM_WAIT_FREE();
        }
    }
}

/**
  * @brief      Read data from SPI slave.
  * @param      pu8TxBuf    Receive buffer.
  * @param      u32NRx      Size of receive buffer in bytes.
  * @return     None.
  */
static void spim_read(uint8_t *pu8RxBuf, uint32_t u32NRx)
{
    while (u32NRx)
    {
        unsigned int dataNum = 0;   // number of words

        if (u32NRx >= 16)
        {
            dataNum = 4;
        }
        else if (u32NRx >= 12)
        {
            dataNum = 3;
        }
        else if (u32NRx >= 8)
        {
            dataNum = 2;
        }
        else if (u32NRx >= 4)
        {
            dataNum = 1;
        }

        if (dataNum)
        {
            _SPIM_SET_OPMODE(SPIM_CTL0_OPMODE_IO);    // Switch to Normal mode.
            _SPIM_SET_DATA_WIDTH(32);
            _SPIM_SET_DATA_NUM(dataNum);
            _SPIM_SET_GO();
            _SPIM_WAIT_FREE();
        }

        while (dataNum)
        {
            uint32_t tmp;

            tmp = *((__I uint32_t *) &SPIM->RX0 + dataNum - 1);
            memcpy(pu8RxBuf, &tmp, 4);
            pu8RxBuf += 4;
            dataNum --;
            u32NRx -= 4;
        }

        if (u32NRx && (u32NRx < 4))
        {
            uint32_t tmp;

            _SPIM_SET_OPMODE(SPIM_CTL0_OPMODE_IO);    // Switch to Normal mode.
            _SPIM_SET_DATA_WIDTH(u32NRx * 8);
            _SPIM_SET_DATA_NUM(1);
            _SPIM_SET_GO();
            _SPIM_WAIT_FREE();

            tmp = SPIM->RX0;
            memcpy(pu8RxBuf, &tmp, u32NRx);
            pu8RxBuf += u32NRx;
            u32NRx = 0;
        }
    }
}

/**
  * @brief      Check if Erase/Write is done.
  * @return     0: Not done. 1: Done.
  */
int SPIM_IsWriteDone(uint32_t u32NBit)
{
    uint8_t status[1];
    SPIM_ReadStatusRegister(status, sizeof(status), u32NBit);
    return !(status[0] & SR_WIP);
}

/**
  * @brief      Wait until Erase/Write done.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0           SPIM write done.
  */
static int spim_wait_write_done(uint32_t u32NBit)
{
    int  count;

    for (count = 0; count < 0x1000000; count++)
    {
        if (SPIM_IsWriteDone(u32NBit))
            return 0;
    }

    SPIM_DRV_DEBUG("spim_wait_write_done time-out!!\n");
    return -1;
}

/**
  * @brief      Issue Write Enable/disable command.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void spim_set_write_enable(int isEn, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {0}; // 1-byte Write Enable command.
    cmdBuf[0] = isEn ? OPCODE_WREN : OPCODE_WRDI;

    _SPIM_SET_SS_EN(1);                             // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                             // CS deactivated.
}

/**
  * @brief      Initialize SPIM flash.
  * @param      clrWP       Clear Write Protect or not.
  * @return     0    Success.
  * @return     -1   Unrecognized manufacture ID or failed on reading manufacture ID.
  */
int SPIM_InitFlash(int clrWP)
{
    uint8_t     idBuf[3];
    uint8_t     cmdBuf[1];

    _SPI_SET_SS_ACTLVL(0);

    // Becuse not usre in SPI or QPI mode, do QPI reset and then SPI reset.
    // QPI Reset Enable
    cmdBuf[0] = OPCODE_RSTEN;
    _SPIM_SET_SS_EN(1);                     // CS activated.
    _SPIM_ENABLE_QUAD_OUTPUT_MODE();        // 1-bit, Output.
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                     // CS deactivated.

