wosayttn/M55M1BSP/_CUnit/spim/spim.c
    // QPI Reset
    cmdBuf[0] = OPCODE_RST;
    _SPIM_SET_SS_EN(1);                     // CS activated.
    _SPIM_ENABLE_QUAD_OUTPUT_MODE();        // 1-bit, Output.
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                     // CS deactivated.

    // SPI ResetEnable
    cmdBuf[0] = OPCODE_RSTEN;
    _SPIM_SET_SS_EN(1);                     // CS activated.
    _SPIM_ENABLE_SING_OUTPUT_MODE();        // 1-bit, Output.
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                     // CS deactivated.

    // SPI Reset
    cmdBuf[0] = OPCODE_RST;
    _SPIM_SET_SS_EN(1);                     // CS activated.
    _SPIM_ENABLE_SING_OUTPUT_MODE();        // 1-bit, Output.
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                     // CS deactivated.

    if (clrWP)
    {
        uint8_t dataBuf[] = {0x00};

        spim_set_write_enable(1, 1);                // Clear Block Protect.
        SPIM_WriteStatusRegister(dataBuf, sizeof(dataBuf), 1);
        spim_wait_write_done(1);
    }

    SPIM_ReadJedecId(idBuf, sizeof(idBuf), 1);

    g_MID = idBuf[0];

    if ((g_MID != MFGID_WINBOND) &&
            (g_MID != MFGID_MXIC) &&
            (g_MID != MFGID_EON) &&
            (g_MID != MFGID_ISSI) &&
            (g_MID != MFGID_SPANSION))
    {
        SPIM_DRV_DEBUG("Flash initailze failed!!\n");
        g_MID = MFGID_UNKNOW;
        return -1;
    }

    return 0;
}

/**
  * @brief      Issue JEDEC ID command.
  * @param      idBuf       ID buffer.
  * @param      u32NRx      Size of ID buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadJedecId(uint8_t *idBuf, unsigned u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = { OPCODE_RDID };         // 1-byte JEDEC ID command.

    _SPIM_SET_SS_EN(1);                         // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(u32NBit);
    spim_read(idBuf, u32NRx);
    _SPIM_SET_SS_EN(0);                         // CS deactivated.
}


static void spim_enable_spansion_quad_mode(int isEn)
{
    uint8_t cmdBuf[3];
    uint8_t dataBuf[1], status1;

    cmdBuf[0] = 0x5;                            // Read Status Register-1

    _SPIM_SET_SS_EN(1);
    SwitchNBitOutput(1);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(1);
    spim_read(dataBuf, sizeof(dataBuf));
    _SPIM_SET_SS_EN(0);

    //SPIM_DRV_DEBUG("SR1 = 0x%x\n", dataBuf[0]);

    status1 = dataBuf[0];

    cmdBuf[0] = 0x35;                           // Read Configuration Register-1

    _SPIM_SET_SS_EN(1);
    SwitchNBitOutput(1);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(1);
    spim_read(dataBuf, sizeof(dataBuf));
    _SPIM_SET_SS_EN(0);

    //    SPIM_DRV_DEBUG("CR1 = 0x%x\n", dataBuf[0]);

    spim_set_write_enable(1, 1);

    cmdBuf[0] =  0x1;                           // Write register
    cmdBuf[1] =  status1;

    if (isEn)
        cmdBuf[2] = dataBuf[0] | 0x2;           // set QUAD
    else
        cmdBuf[2] = dataBuf[0] & ~0x2;          // clear QUAD

    _SPIM_SET_SS_EN(1);
    SwitchNBitOutput(1);
    spim_write(cmdBuf, 3);
    _SPIM_SET_SS_EN(0);

    spim_set_write_enable(0, 1);


    cmdBuf[0] = 0x35;                           // Read Configuration Register-1

    _SPIM_SET_SS_EN(1);
    SwitchNBitOutput(1);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(1);
    spim_read(dataBuf, sizeof(dataBuf));
    _SPIM_SET_SS_EN(0);

    SPIM_DRV_DEBUG("CR1 = 0x%x\n", dataBuf[0]);
}

/**
  * @brief      Set Quad Enable/disable.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_SetQuadEnable(int isEn, uint32_t u32NBit)
{
    uint8_t idBuf[3];

    SPIM_ReadJedecId(idBuf, sizeof(idBuf), u32NBit);

    //SPIM_DRV_DEBUG("Flash ID is 0x%x\n", idBuf[0]);

    switch (idBuf[0])
    {
        case MFGID_WINBOND:                     // Winbond SPI flash.
        {
            uint8_t dataBuf[1];
            spim_set_write_enable(1, u32NBit);      // Write Enable.
            dataBuf[0] = isEn ? SR2_QE : 0;
            SPIM_WriteStatusRegister2(dataBuf, sizeof(dataBuf), u32NBit);
            spim_wait_write_done(u32NBit);
            break;
        }

        case MFGID_MXIC:                        // MXIC SPI flash.
        case MFGID_EON:
        case MFGID_ISSI:                        // ISSI SPI flash.
        {
            uint8_t dataBuf[1];

            spim_set_write_enable(1, u32NBit);      // Write Enable.
            dataBuf[0] = isEn ? SR_QE : 0;
            SPIM_WriteStatusRegister(dataBuf, sizeof(dataBuf), u32NBit);
            spim_wait_write_done(u32NBit);
            break;
        }

        case MFGID_SPANSION:
            spim_enable_spansion_quad_mode(isEn);
            return;
    }
}

/**
  * @brief      Enter/exit QPI mode.
  * @param      isEn        Enable/disable.
  * @return     None.
  */
void SPIM_SetQpiMode(int isEn)
{
    uint8_t cmdBuf[1];                                  // 1-byte command.

    uint8_t status[1];
    SPIM_ReadStatusRegister(status, sizeof(status), 1);
    SPIM_DRV_DEBUG("Status: 0x%x\n", status[0]);

    if (isEn)                                           // Assume in SPI mode.
    {
        cmdBuf[0] = OPCODE_ENQPI;

        _SPIM_SET_SS_EN(1);                             // CS activated.
        SwitchNBitOutput(1);
        spim_write(cmdBuf, sizeof(cmdBuf));
        _SPIM_SET_SS_EN(0);                             // CS deactivated.
    }
    else                                                // Assume in QPI mode.
    {
        cmdBuf[0] = OPCODE_EXQPI;

        _SPIM_SET_SS_EN(1);                             // CS activated.
        SwitchNBitOutput(4);
        spim_write(cmdBuf, sizeof(cmdBuf));
        _SPIM_SET_SS_EN(0);                             // CS deactivated.
    }

    SPIM_ReadStatusRegister(status, sizeof(status), 1);
    SPIM_DRV_DEBUG("Status: 0x%x\n", status[0]);
}


static void SPIM_SPANSION_4Bytes_Enable(int isEn, uint32_t u32NBit)
{
    uint8_t cmdBuf[2];
    uint8_t dataBuf[1];

    cmdBuf[0] = OPCODE_BRRD;
    _SPIM_SET_SS_EN(1);                         // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, 1);
    SwitchNBitInput(1);
    spim_read(dataBuf, 1);
    _SPIM_SET_SS_EN(0);                         // CS deactivated.

