wosayttn/M55M1BSP/_CUnit/spim/spim.c
    SPIM_DRV_DEBUG("Bank Address register= 0x%x\n", dataBuf[0]);

    cmdBuf[0] =  OPCODE_BRWR;

    if (isEn)
        cmdBuf[1] = dataBuf[0] | 0x80;          // set EXTADD
    else
        cmdBuf[1] = dataBuf[0] & ~0x80;         // clear EXTADD

    _SPIM_SET_SS_EN(1);                         // CS activated.
    SwitchNBitOutput(1);
    spim_write(cmdBuf, 2);
    _SPIM_SET_SS_EN(0);                         // CS deactivated.
}

/**
  * @brief      Query 4-byte address mode enabled or not.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0: 4-byte address mode disabled. 1: 4-byte address mode enabled.
  */
int SPIM_Is4ByteModeEnable(uint32_t u32NBit)
{
    int isEn = 0;
    uint8_t idBuf[3];

    SPIM_ReadJedecId(idBuf, sizeof(idBuf), u32NBit);

    // Based on Flash size, check if 4-byte address mode is supported.
    {
        int isSupt = 0;

        switch (idBuf[0])
        {
            case MFGID_WINBOND:
            case MFGID_MXIC:
            case MFGID_EON:
                isSupt = (idBuf[2] < 0x19) ? 0 : 1;
                break;

            case MFGID_ISSI:
                isSupt = (idBuf[2] < 0x49) ? 0 : 1;
                break;
        }

        if (! isSupt)
        {
            return isEn;
        }
    }

    do
    {
        if (idBuf[0] == MFGID_WINBOND)      // Winbond SPI flash.
        {
            uint8_t dataBuf[1];
            SPIM_ReadStatusRegister3(dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SR3_ADR);
        }
        else if (idBuf[0] == MFGID_MXIC || idBuf[0] == MFGID_EON)    // MXIC/EON SPI flash.
        {
            uint8_t dataBuf[1];
            SPIM_ReadSecurityRegister(dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SCUR_4BYTE);
        }
    } while (0);

    return isEn;
}

/**
  * @brief      Enter/Exit 4-byte address mode.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_Enable_4Bytes_Mode(int isEn, uint32_t u32NBit)
{
    uint8_t idBuf[3];
    SPIM_ReadJedecId(idBuf, sizeof(idBuf), u32NBit);

    // Based on Flash size, check if 4-byte address mode is supported.
    {
        int isSupt = 0;

        switch (idBuf[0])
        {
            case MFGID_WINBOND:
            case MFGID_MXIC:
            case MFGID_EON:
                isSupt = (idBuf[2] < 0x19) ? 0 : 1;
                break;

            case MFGID_ISSI:
                isSupt = (idBuf[2] < 0x49) ? 0 : 1;
                break;

            case MFGID_SPANSION:
                SPIM_SPANSION_4Bytes_Enable(isEn, u32NBit);
                return;
        }

        if (! isSupt)
        {
            return;
        }
    }

    do
    {
        uint8_t cmdBuf[1];  // 1-byte Enter/Exit 4-Byte Mode command.
        cmdBuf[0] = isEn ? OPCODE_EN4B : OPCODE_EX4B;

        _SPIM_SET_SS_EN(1);                             // CS activated.
        SwitchNBitOutput(u32NBit);
        spim_write(cmdBuf, sizeof(cmdBuf));
        _SPIM_SET_SS_EN(0);                             // CS deactivated.

        // FIXME: Per test, 4BYTE Indicator bit doesn't set after EN4B, which doesn't match spec(MX25L25635E),
        // so skip the check below.
        if (idBuf[0] == MFGID_MXIC)
        {
            break;
        }

        if (isEn)
        {
            while (! SPIM_Is4ByteModeEnable(u32NBit));
        }
        else
        {
            while (SPIM_Is4ByteModeEnable(u32NBit));
        }
    } while (0);
}

/**
  * @brief      Erase whole chip.
  * @param      u32NBit     N-bit transmit/receive.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_ChipErase(uint32_t u32NBit, int isSync)
{
    uint8_t cmdBuf[] = { OPCODE_CHIP_ERASE };      // 1-byte Chip Erase command.

    spim_set_write_enable(1, u32NBit);             // Write Enable.

    _SPIM_SET_SS_EN(1);                        // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                        // CS deactivated.

    if (isSync)
    {
        spim_wait_write_done(u32NBit);
    }
}

/**
  * @brief      Erase one block.
  * @param      u32Addr         Block to erase which contains the u32Addr.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u32ErsCmd       Erase command.
  * @param      u32NBit         N-bit transmit/receive.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_EraseBlock(uint32_t u32Addr, int is4ByteAddr, uint32_t u32ErsCmd, uint32_t u32NBit, int isSync)
{
    spim_set_write_enable(1, u32NBit); // Write Enable.

    do
    {
        uint8_t cmdBuf[16];
        uint8_t *cmdBufInd = (uint8_t *) cmdBuf;

        *cmdBufInd ++ = u32ErsCmd;

        if (is4ByteAddr)
        {
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 24);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 16);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 8);
            *cmdBufInd ++ = (uint8_t) u32Addr;
        }
        else
        {
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 16);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 8);
            *cmdBufInd ++ = (uint8_t) u32Addr;
        }

        _SPIM_SET_SS_EN(1);                 // CS activated.
        SwitchNBitOutput(u32NBit);
        spim_write(cmdBuf, cmdBufInd - (uint8_t *) cmdBuf);
        _SPIM_SET_SS_EN(0);                 // CS deactivated.
    } while (0);

    if (isSync)
        spim_wait_write_done(u32NBit);
}

/**
  * @brief      Write data in the same page by I/O mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_WriteInPageDataByIo(uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx, uint8_t *pu8TxBuf, uint32_t wrCmd,
                              uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, int isSync)
{
    spim_set_write_enable(1, u32NBitCmd);                          // Write Enable.

    do
    {
        uint8_t cmdBuf[16];
        uint8_t *cmdBufOrig = (uint8_t *) cmdBuf;
        uint8_t *cmdBufInd = (uint8_t *) cmdBuf;

        _SPIM_SET_SS_EN(1);                         // CS activated.

        SwitchNBitOutput(u32NBitCmd);
        *cmdBufInd ++ = wrCmd;
        spim_write(cmdBufOrig, cmdBufInd - cmdBufOrig);   // Write out command.
        cmdBufOrig = cmdBufInd;

        if (is4ByteAddr)
        {
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 24);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 16);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 8);
            *cmdBufInd ++ = (uint8_t) u32Addr;
        }
        else
        {
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 16);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 8);
            *cmdBufInd ++ = (uint8_t) u32Addr;
        }

        SwitchNBitOutput(u32NBitAddr);
        spim_write(cmdBufOrig, cmdBufInd - cmdBufOrig);       // Write out u32Address.
        cmdBufOrig = cmdBufInd;

        SwitchNBitOutput(u32NBitDat);
        spim_write(pu8TxBuf, u32NTx);                               // Write out data.

        _SPIM_SET_SS_EN(0);                         // CS deactivated.
    } while (0);

