wosayttn/M55M1BSP/_CUnit/spim/spim.c
    if (isSync)
    {
        spim_wait_write_done(u32NBitCmd);
    }
}

/**
  * @brief      Write data in the same page by Page Write mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_WriteInPageDataByPageWrite(uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx, uint8_t *pu8TxBuf,
                                     uint32_t wrCmd, int isSync)
{
    if (wrCmd == CMD_QUAD_PAGE_PROGRAM_WINBOND ||
            wrCmd == CMD_QUAD_PAGE_PROGRAM_MXIC)
    {
        SPIM_SetQuadEnable(1, 1);                             // Set Quad Enable.
    }
    else if (wrCmd == CMD_QUAD_PAGE_PROGRAM_EON)
    {
        SPIM_SetQuadEnable(1, 1);                             // Set Quad Enable.
        SPIM_SetQpiMode(1);                                   // Enter QPI mode.
    }

    _SPIM_SET_OPMODE(SPIM_CTL0_OPMODE_PAGEWRITE);         // Switch to Page Write mode.
    _SPIM_SET_SPIM_MODE(wrCmd);                               // SPIM mode.
    _SPIM_SET_4BYTE_ADDR_EN(is4ByteAddr);                     // Enable/disable 4-Byte Address.

    SPIM->SRAMADDR = (uint32_t) pu8TxBuf;                              // SRAM u32Address.
    SPIM->DMACNT = u32NTx;                                           // Transfer length.
    SPIM->FADDR = u32Addr;                                        // Flash u32Address.
    _SPIM_SET_GO();                                             // Go.

    if (isSync)
    {
        _SPIM_WAIT_FREE();
    }

    if (wrCmd == CMD_QUAD_PAGE_PROGRAM_EON)
    {
        SPIM_SetQpiMode(0);                                   // Exit QPI mode.
    }
}


/**
  * @brief      Write data to SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr: Start u32Address to write.
  * @param      is4ByteAddr: 4-byte u32Address or not.
  * @param      u32NTx: Number of bytes to write.
  * @param      pu8TxBuf: Transmit buffer.
  * @param      wrCmd: Write command.
  * @param      u32NBitCmd: N-bit transmit command.
  * @param      u32NBitAddr: N-bit transmit u32Address.
  * @param      u32NBitDat: N-bit transmit/receive data.
  * @return     None.
  */
void SPIM_IO_Write(uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx, uint8_t *pu8TxBuf, uint32_t wrCmd,
                   uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat)
{
    do
    {
        uint32_t pageOffset = u32Addr % 256;

        if ((pageOffset + u32NTx) <= 256)                      // Do all the bytes fit onto one page ?
        {
            SPIM_WriteInPageDataByIo(u32Addr, is4ByteAddr, u32NTx, pu8TxBuf, wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
        }
        else
        {
            uint32_t toWr = 256 - pageOffset;               // Size of data remaining on the first page.

            SPIM_WriteInPageDataByIo(u32Addr, is4ByteAddr, toWr, pu8TxBuf, wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
            u32Addr += toWr;                                   // Advance indicator.
            u32NTx -= toWr;
            pu8TxBuf += toWr;

            while (u32NTx)
            {
                toWr = 256;

                if (toWr > u32NTx)
                {
                    toWr = u32NTx;
                }

                SPIM_WriteInPageDataByIo(u32Addr, is4ByteAddr, toWr, pu8TxBuf, wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
                u32Addr += toWr;                               // Advance indicator.
                u32NTx -= toWr;
                pu8TxBuf += toWr;
            }
        }
    } while (0);
}

/**
  * @brief      Read data from SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      u32RdCmd    Read command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      u32NDummy   Number of dummy bytes following address.
  * @return     None.
  */
void SPIM_IO_Read(uint32_t u32Addr, int is4ByteAddr, uint32_t u32NRx, uint8_t *pu8RxBuf, uint32_t u32RdCmd,
                  uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, int u32NDummy)
{
    do
    {
        uint8_t cmdBuf[16];
        uint8_t *cmdBufInd = (uint8_t *) cmdBuf;
        uint8_t *cmdBufOrig = (uint8_t *) cmdBuf;

        _SPIM_SET_SS_EN(1);                         // CS activated.

        *cmdBufInd ++ = u32RdCmd;
        SwitchNBitOutput(u32NBitCmd);
        spim_write(cmdBufOrig, cmdBufInd - cmdBufOrig);       // Write out command.
        cmdBufOrig = cmdBufInd;

        if (is4ByteAddr)
        {
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 24);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 16);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 8);
            *cmdBufInd ++ = (uint8_t) u32Addr;
        }
        else
        {
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 16);
            *cmdBufInd ++ = (uint8_t)(u32Addr >> 8);
            *cmdBufInd ++ = (uint8_t) u32Addr;
        }

        SwitchNBitOutput(u32NBitAddr);
        spim_write(cmdBufOrig, cmdBufInd - cmdBufOrig);       // Write out u32Address.
        cmdBufOrig = cmdBufInd;

        while (u32NDummy --)
        {
            *cmdBufInd ++ = 0x00;
        }

        // Same bit mode as above.
        spim_write(cmdBufOrig, cmdBufInd - cmdBufOrig);       // Write out dummy bytes.
        cmdBufOrig = cmdBufInd;

        SwitchNBitInput(u32NBitDat);
        spim_read(pu8RxBuf, u32NRx);                                // Read back data.

        _SPIM_SET_SS_EN(0);                     // CS deactivated.
    } while (0);
}

/**
  * @brief      Write data to SPI Flash by Page Write mode.
  * @param      u32Addr     Start address to write.
  * @param      is4ByteAddr 4-byte address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @return     None.
  */
void SPIM_DMA_Write(uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx, uint8_t *pu8TxBuf, uint32_t wrCmd)
{
    do
    {
        uint32_t pageOffset = u32Addr % 256;

        if ((pageOffset + u32NTx) <= 256)              // Do all the bytes fit onto one page ?
        {
            SPIM_WriteInPageDataByPageWrite(u32Addr, is4ByteAddr, u32NTx, pu8TxBuf, wrCmd, 1);
        }
        else
        {
            uint32_t toWr = 256 - pageOffset;       // Size of data remaining on the first page.

            SPIM_WriteInPageDataByPageWrite(u32Addr, is4ByteAddr, toWr, pu8TxBuf, wrCmd, 1);

