wosayttn/M55M1BSP/_CUnit/spim/spim.c
            u32Addr += toWr;                                           // Advance indicator.
            u32NTx -= toWr;
            pu8TxBuf += toWr;

            while (u32NTx)
            {
                toWr = 256;

                if (toWr > u32NTx)
                {
                    toWr = u32NTx;
                }

                SPIM_WriteInPageDataByPageWrite(u32Addr, is4ByteAddr, toWr, pu8TxBuf, wrCmd, 1);

                u32Addr += toWr;                                           // Advance indicator.
                u32NTx -= toWr;
                pu8TxBuf += toWr;
            }
        }
    } while (0);
}

/**
  * @brief      Read data from SPI Flash by Page Read mode.
  * @param      u32Addr     Start address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      u32RdCmd    Read command.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_DMA_Read(uint32_t u32Addr, int is4ByteAddr, uint32_t u32NRx, uint8_t *pu8RxBuf,
                   uint32_t u32RdCmd, int isSync)
{
    if ((u32RdCmd == CMD_DMA_FAST_QUAD_READ) || (u32RdCmd == CMD_DMA_NORMAL_QUAD_READ))
    {
        SPIM_SetQuadEnable(1, 1);                   // Set Quad Enable.
    }

    _SPIM_SET_OPMODE(SPIM_CTL0_OPMODE_PAGEREAD);    // Switch to Page Read mode.
    _SPIM_SET_SPIM_MODE(u32RdCmd);                  // SPIM mode.
    _SPIM_SET_4BYTE_ADDR_EN(is4ByteAddr);           // Enable/disable 4-Byte Address.

    SPIM->SRAMADDR = (uint32_t) pu8RxBuf;           // SRAM u32Address.
    SPIM->DMACNT = u32NRx;                          // Transfer length.
    SPIM->FADDR = u32Addr;                          // Flash u32Address.
    _SPIM_SET_GO();                                 // Go.

    if (isSync)
    {
        _SPIM_WAIT_FREE();                          // Wait for DMA done.
    }
}

/**
  * @brief      Enter Direct Map mode.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u32RdCmd        Read command.
  * @param      u32IdleIntvl    Idle interval.
  * @return     None.
  */
void SPIM_EnterDirectMapMode(int is4ByteAddr, uint32_t u32RdCmd, uint32_t u32IdleIntvl)
{
    if ((u32RdCmd == CMD_DMA_FAST_QUAD_READ) || (u32RdCmd == CMD_DMA_NORMAL_QUAD_READ))
    {
        SPIM_SetQuadEnable(1, 1);               // Set Quad Enable.
    }

    _SPIM_SET_4BYTE_ADDR_EN(is4ByteAddr);       // Enable/disable 4-byte u32Address.
    _SPIM_SET_SPIM_MODE(u32RdCmd);              // SPIM mode.
    _SPI_SET_IDL_INTVL(u32IdleIntvl);           // Idle interval.
    _SPIM_SET_OPMODE(SPIM_CTL0_OPMODE_DIRECTMAP);     // Switch to Direct Map mode.
}

/**
  * @brief      Exit Direct Map mode.
  * @return     None.
  */
void SPIM_ExitDirectMapMode()
{
    _SPIM_SET_OPMODE(SPIM_CTL0_OPMODE_IO);  // Switch back to Normal mode.
}



/**
  * @brief      Issue Write Status Register #1 command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_WriteStatusRegister(uint8_t *dataBuf, unsigned u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSR, 0x00};                         // 1-byte Write Status Register #1 command + 1-byte data.
    cmdBuf[1] = dataBuf[0];

    _SPIM_SET_SS_EN(1);                         // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                         // CS deactivated.
}

/**
  * @brief      Issue Read Status Register #1 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
 * @param       u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadStatusRegister(uint8_t *dataBuf, unsigned u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR};           // 1-byte Read Status Register #1 command.

    _SPIM_SET_SS_EN(1);                         // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(u32NBit);
    spim_read(dataBuf, u32NRx);
    _SPIM_SET_SS_EN(0);                         // CS deactivated.
}

/**
  * @brief      Issue Write Status Register #2 command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_WriteStatusRegister2(uint8_t *dataBuf, unsigned u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSR2, 0x00};    // 1-byte Write Status Register #2 command + 1-byte data.
    cmdBuf[1] = dataBuf[0];

    _SPIM_SET_SS_EN(1);                             // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                             // CS deactivated.
}

/**
  * @brief      Issue Read Status Register #2 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
 * @param       u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadStatusRegister2(uint8_t *dataBuf, unsigned u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR2};          // 1-byte Read Status Register #1 command.

    _SPIM_SET_SS_EN(1);                         // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(u32NBit);
    spim_read(dataBuf, sizeof(dataBuf));
    _SPIM_SET_SS_EN(0);                         // CS deactivated.
}

/**
  * @brief      Issue Write Status Register #3 command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_WriteStatusRegister3(uint8_t *dataBuf, unsigned u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSR3, 0x00};    // 1-byte Write Status Register #2 command + 1-byte data.
    cmdBuf[1] = dataBuf[0];

    _SPIM_SET_SS_EN(1);                             // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                             // CS deactivated.
}

/**
  * @brief      Issue Read Status Register #3 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadStatusRegister3(uint8_t *dataBuf, unsigned u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR3};          // 1-byte Read Status Register #1 command.

    _SPIM_SET_SS_EN(1);                             // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(u32NBit);
    spim_read(dataBuf, sizeof(dataBuf));
    _SPIM_SET_SS_EN(0);                             // CS deactivated.
}

/**
  * @brief      Issue Write Security Register command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_WriteSecurityRegister(uint8_t *dataBuf, unsigned u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSCUR, 0x00};   // 1-byte Write Status Register #2 command + 1-byte data.
    cmdBuf[1] = dataBuf[0];

    _SPIM_SET_SS_EN(1);                             // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    _SPIM_SET_SS_EN(0);                             // CS deactivated.
}

/**
  * @brief      Issue Read Security Register command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadSecurityRegister(uint8_t *dataBuf, unsigned u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSCUR};         // 1-byte Read Status Register #1 command.

    _SPIM_SET_SS_EN(1);                             // CS activated.
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(u32NBit);
    spim_read(dataBuf, sizeof(dataBuf));
    _SPIM_SET_SS_EN(0);                             // CS deactivated.
}

/*@}*/ /* end of group M480_SPIM_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group M480_SPIM_Driver */

/*@}*/ /* end of group M480_Device_Driver */

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/
